{"Dessert": [{"name": "Banoffee Snack Cake\n", "ingredients": "Ingredients\n2 cups all-purpose flour\n\n1 teaspoon baking soda\n\n3/4 teaspoon plus 1 dash sea salt, divided\n\n4 ripe bananas, peeled\n\n1/2 cup melted unsalted butter, divided\n\n1/3 cup sour cream\n\n1 1/2 cups packed light brown sugar, divided\n\n2 large eggs, at room temperature\n\n3 teaspoons vanilla extract, divided\n\n1 cup caramel bits (such as Kraft®, optional)\n\n3 ounces shortbread cookies\n\n1/4 cup unsalted butter\n\n1/3 cup whole milk\n\n2 cups confectioner's sugar", "details": "Directions\nPreheat the oven to 350 degrees F (175 degrees C) and position a rack in the center. Coat a 9-inch square baking pan with cooking spray. Line pan with parchment paper, leaving 1 to 2 inches of overhang; coat parchment with cooking spray.\n\nWhisk together flour, baking soda, and 1/2 teaspoon salt in a medium bowl.\n\nIn a large bowl, mash bananas with a fork until coarsely mashed. Add 6 tablespoons melted butter and the sour cream and mix until well combined. Whisk in 1 cup brown sugar, then the eggs, then 2 teaspoons vanilla until well combined. Stir in flour mixture with a silicone spatula. Fold in caramel bits. Pour batter into the prepared pan and spread in an even layer.\n\nBake in the preheated oven until cake springs back lightly when touched in center, 45 to 55 minutes. Transfer pan to a wire rack. Let cool completely.\n\nWhile cake cools, make crumb topping. Put cookies in a large zip-top bag, seal bag, and use a rolling pin to crush cookies into coarse crumbs. Transfer crumbs to a small bowl. Stir in remaining 2 tablespoons melted butter and dash of salt.\n\nFor caramel glaze, melt the 1/4 cup butter in a small saucepan over medium heat. Stir in remaining 1/2 cup brown sugar and cook, stirring occasionally, until mixture begins to boil. Add milk and bring to a simmer. Remove from heat and whisk in powdered sugar and remaining 1 teaspoon vanilla and 1/4 teaspoon salt until completely smooth.\n\nSpread hot glaze in an even layer over cake. Immediately sprinkle with crumb topping. Let cake stand at room temperature until glaze sets, about 15 minutes.\n\nRun a small offset spatula or a knife around outside of cake and use parchment lining to transfer cake to a cutting board. Cut into 12 triangles. Chill in an airtight container until ready to serve, up to 4 days."}, {"name": "Homemade Baked Egg Custard", "ingredients": "Ingredients\n1 (9-inch) single unbaked pie crust\n\nEgg Custard Filling:\n\n4 large eggs\n\n½ cup white sugar\n\n2 teaspoons vanilla extract\n\n2 cups milk\n\n1 pinch ground nutmeg, or to taste", "details": "Directions\nGather all ingredients. Preheat the oven to 400 degrees F (200 degrees C).\n\nPlace pastry into a 9-inch pie plate so it covers the bottom and the sides. Crimp edge, if desired.\n\nLine the bottom of pastry with foil or parchment and fill with dried beans or pie weights. Bake in the preheated oven for 8 minutes.\n\nRemove lining and beans or weights; continue baking until crust is set and dry, about 5 minutes. Reduce oven temperature to 350 degrees F. Let pastry cool about 10 minutes while preparing filling.\n\nTo make egg custard filling: Beat eggs and sugar in a bowl with an electric mixer until combined.  Beat in vanilla. Gradually stir in milk until fully incorporated.\n\nPour custard mixture over partially baked crust. Note that the crust will be full.\n\nSprinkle nutmeg over the filling. Bake in the preheated oven until custard is set and a sharp knife inserted near the center comes out clean, about 40 minutes. Cover edge of pastry with foil for the last 15 minutes of baking to prevent overbrowning.\n\nCool completely before serving, about 1 hour."}]}